AccumulationRegisters/ТрудозатратыКОформлению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТрудозатратыКОформлению</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартияПроизводства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииПроизводства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Распоряжение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
						<v8:Type>cfg:DocumentRef.ПроизводственнаяОперация2_2</v8:Type>
						<v8:Type>cfg:DocumentRef.ПроизводствоБезЗаказа</v8:Type>
						<v8:Type>cfg:DocumentRef.МаршрутныйЛистПроизводства</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаРемонт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсполнительРабот</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСтрокиРаспоряжения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТрудозатратыКОформлению/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Или Не ПроведениеДокументов.РассчитыватьИзменения(ДополнительныеСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	БлокироватьДляИзменения = Истина;
	
	// Текущее состояние набора помещается во временную таблицу,
	// чтобы при записи получить изменение нового набора относительно текущего.
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("ЭтоНовый",    ДополнительныеСвойства.СвойстваДокумента.ЭтоНовый);
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Таблица.Период, МЕСЯЦ) КАК Месяц,
	|	Таблица.Организация             КАК Организация,
	|	Таблица.ПартияПроизводства      КАК ПартияПроизводства,
	|	Таблица.Распоряжение            КАК Распоряжение,
	|	Таблица.ВидРабот                КАК ВидРабот,
	|	Таблица.Исполнитель             КАК Исполнитель,
	|	Таблица.Подразделение           КАК Подразделение,
	|	Таблица.КодСтрокиРаспоряжения   КАК КодСтрокиРаспоряжения,
	// Контролировать необходимо только уменьшение остатка - для этого показатель берется по модулю.
	|	ВЫБОР
	|		КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			И Таблица.Количество > 0
	|			ТОГДА Таблица.Количество
	|		КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			И Таблица.Количество < 0
	|			ТОГДА -Таблица.Количество
	|		КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			И Таблица.Количество > 0
	|			ТОГДА -Таблица.Количество
	|		ИНАЧЕ Таблица.Количество
	|	КОНЕЦ                           КАК КоличествоПередЗаписью
	|ПОМЕСТИТЬ ДвиженияТрудозатратыКОформлениюПередЗаписью
	|ИЗ
	|	РегистрНакопления.ТрудозатратыКОформлению КАК Таблица
	|ГДЕ
	|	Таблица.Регистратор = &Регистратор
	|	И НЕ &ЭтоНовый
	// Исправление и сторно может формировать отрицательные остатки по исходным распоряжениям.
	|	И НЕ Таблица.Сторно
	|";
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Или Не ПроведениеДокументов.РассчитыватьИзменения(ДополнительныеСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаИзменений.Месяц                         КАК Месяц,
	|	ТаблицаИзменений.Организация                   КАК Организация,
	|	ТаблицаИзменений.ПартияПроизводства            КАК ПартияПроизводства,
	|	ТаблицаИзменений.Распоряжение                  КАК Распоряжение,
	|	ТаблицаИзменений.ВидРабот                      КАК ВидРабот,
	|	ТаблицаИзменений.Исполнитель                   КАК Исполнитель,
	|	ТаблицаИзменений.Подразделение                 КАК Подразделение,
	|	ТаблицаИзменений.КодСтрокиРаспоряжения         КАК КодСтрокиРаспоряжения,
	|	СУММА(ТаблицаИзменений.КоличествоИзменение)    КАК КоличествоИзменение
	|ПОМЕСТИТЬ ДвиженияТрудозатратыКОформлениюИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		Таблица.Месяц                   КАК Месяц,
	|		Таблица.Организация             КАК Организация,
	|		Таблица.ПартияПроизводства      КАК ПартияПроизводства,
	|		Таблица.Распоряжение            КАК Распоряжение,
	|		Таблица.ВидРабот                КАК ВидРабот,
	|		Таблица.Исполнитель             КАК Исполнитель,
	|		Таблица.Подразделение           КАК Подразделение,
	|		Таблица.КодСтрокиРаспоряжения   КАК КодСтрокиРаспоряжения,
	|		Таблица.КоличествоПередЗаписью  КАК КоличествоИзменение
	|	ИЗ
	|		ДвиженияТрудозатратыКОформлениюПередЗаписью КАК Таблица
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Таблица.Период, МЕСЯЦ) КАК Месяц,
	|		Таблица.Организация             КАК Организация,
	|		Таблица.ПартияПроизводства      КАК ПартияПроизводства,
	|		Таблица.Распоряжение            КАК Распоряжение,
	|		Таблица.ВидРабот                КАК ВидРабот,
	|		Таблица.Исполнитель             КАК Исполнитель,
	|		Таблица.Подразделение           КАК Подразделение,
	|		Таблица.КодСтрокиРаспоряжения   КАК КодСтрокиРаспоряжения,
	// Контролировать необходимо только уменьшение остатка - для этого показатель берется по модулю.
	|		ВЫБОР
	|			КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И Таблица.Количество > 0
	|				ТОГДА -Таблица.Количество
	|			КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И Таблица.Количество < 0
	|				ТОГДА Таблица.Количество
	|			КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И Таблица.Количество > 0
	|				ТОГДА Таблица.Количество
	|			ИНАЧЕ -Таблица.Количество
	|		КОНЕЦ                           КАК КоличествоИзменение
	|	ИЗ
	|		РегистрНакопления.ТрудозатратыКОформлению КАК Таблица
	|	ГДЕ
	|		Таблица.Регистратор = &Регистратор
	// Исправление и сторно может формировать отрицательные остатки по исходным распоряжениям.
	|		И НЕ Таблица.Сторно) КАК ТаблицаИзменений
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.Месяц,
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.ПартияПроизводства,
	|	ТаблицаИзменений.Распоряжение,
	|	ТаблицаИзменений.ВидРабот,
	|	ТаблицаИзменений.Исполнитель,
	|	ТаблицаИзменений.Подразделение,
	|	ТаблицаИзменений.КодСтрокиРаспоряжения
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаИзменений.КоличествоИзменение) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц,
	|	Организация,
	|	ПартияПроизводства,
	|	Распоряжение,
	|	ВидРабот,
	|	Исполнитель,
	|	Подразделение,
	|	КодСтрокиРаспоряжения
	|;
	|УНИЧТОЖИТЬ ДвиженияТрудозатратыКОформлениюПередЗаписью
	|";
	
	Выборка = Запрос.ВыполнитьПакет()[0].Выбрать();
	ПроведениеДокументов.ЗарегистрироватьТаблицуКонтроля(ДополнительныеСвойства,
		"ДвиженияТрудозатратыКОформлениюИзменение", Выборка.Следующий() И Выборка.Количество > 0);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
